# Gruppierung

### Folie 1 Pandas Seite 57

In [70]:
import pandas as pd
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

### Titanic Daten

In [71]:
url = 'https://hbiostat.org/data/repo/titanic5.xlsx '

In [72]:
# t = pd.read_excel(url, sheet_name='Titanic5_all').convert_dtypes() #Wichtig um damit zu arbeiten
# file = 'data/titanic.pickle' # Damit es local gespeichert wird
# t.to_pickle(file)

In [73]:
file_prep = 'data/titanic_prepared.pickle'
t = pd.read_pickle(file_prep)
t.dtypes

Name_ID                 Int64
Name           string[python]
Sex            string[python]
Age                   Float64
Class          string[python]
Ticket         string[python]
Joined         string[python]
Occupation     string[python]
Boat [Body]    string[python]
Price          string[python]
Job            string[python]
Survived                Int64
URL            string[python]
Last           string[python]
Title          string[python]
First          string[python]
DoB            string[python]
Year_Birth     string[python]
Date_Death     string[python]
DoB_Clean      string[python]
Age_F_Code     string[python]
Age_F                 Float64
sibsp                   Int64
parch                   Int64
dtype: object

In [74]:
t.sample(3)

,Name_ID,Name,Sex,Age,Class,Ticket,Joined,Occupation,Boat [Body],Price,...,Title,First,DoB,Year_Birth,Date_Death,DoB_Clean,Age_F_Code,Age_F,sibsp,parch
774,1248,"MALACHARD, Mr Jean-Noël",male,25.0,2,237735,Cherbourg,<NA>,,£15 11d,...,Mr,Jean-Noël,1886-12-21,<NA>,1912-04-15 00:00:00,12/21/1886,C,25.0,0,0
2082,896,"HEWLETT, Mrs Mary Dunbar",female,56.0,2,248706,Southampton,<NA>,13,£16,...,Mrs,Mary Dunbar,1855-07-08,<NA>,1917-05-09 00:00:00,7/8/1855,C,56.0,0,0
465,2133,"WHITE, Mr Richard Frasar",male,21.0,1,35281,Southampton,<NA>,[169],£77 5s 9d,...,Mr,Richard Frasar,<NA>,December 1890,1912-04-15 00:00:00,12/15/1890,D,21.0,0,1

In [75]:
t.columns

Index(['Name_ID', 'Name', 'Sex', 'Age', 'Class', 'Ticket', 'Joined',
       'Occupation', 'Boat [Body]', 'Price', 'Job', 'Survived', 'URL', 'Last',
       'Title', 'First', 'DoB', 'Year_Birth', 'Date_Death', 'DoB_Clean',
       'Age_F_Code', 'Age_F', 'sibsp', 'parch'],
      dtype='object')

### Wertebereich

In [76]:
# set(t["Class"]) #Python Menge daraus machen
print(t["Class"].unique())
print(t["Joined"].unique())
print(t["Boat [Body]"].unique())
print(t["Boat [Body]"].unique())

<StringArray>
['3', '2', '1', 'V', 'R', 'E', 'D', 'B']
Length: 8, dtype: string
<StringArray>
['Southampton', 'Cherbourg', 'Queenstown', 'Belfast']
Length: 4, dtype: string
<StringArray>
[    '10',     '  ',     '16',      '4',     'C ',     '11',     '13',
   ' [4]',     '15',     '14',
 ...
 ' [234]', ' [249]', ' [171]',  ' [96]', ' [269]',  ' [22]', ' [187]',
 ' [156]',  ' [45]', ' [245]']
Length: 260, dtype: string
<StringArray>
[    '10',     '  ',     '16',      '4',     'C ',     '11',     '13',
   ' [4]',     '15',     '14',
 ...
 ' [234]', ' [249]', ' [171]',  ' [96]', ' [269]',  ' [22]', ' [187]',
 ' [156]',  ' [45]', ' [245]']
Length: 260, dtype: string

Datenqualität: Wieviele Passagiere und Crew sind es?

In [77]:
# Es müssten 2200 Personen laut Wikipedia sein.897 Crew
t.shape

(2208, 24)

Gruppen bilden

In [78]:
g = t.groupby(by=["Class", "Sex"])
g

In [79]:
g.groups

{('1', 'female'): [21, 109, 144, 145, 168, 173, 199, 232, 243, 247, 248, 263, 276, 290, 298, 415, 430, 455, 477, 485, 502, 503, 539, 542, 543, 578, 581, 612, 632, 649, 673, 680, 693, 712, 734, 745, 779, 822, 835, 899, 902, 917, 985, 1045, 1078, 1127, 1135, 1189, 1208, 1222, 1230, 1245, 1274, 1275, 1282, 1290, 1375, 1394, 1397, 1403, 1404, 1428, 1474, 1476, 1478, 1482, 1483, 1502, 1517, 1533, 1534, 1537, 1546, 1581, 1603, 1666, 1678, 1684, 1686, 1692, 1700, 1713, 1721, 1724, 1725, 1726, 1747, 1755, 1766, 1784, 1815, 1817, 1862, 1867, 1874, 1879, 1892, 1902, 1913, 1921, ...], ('1', 'male'): [10, 45, 65, 99, 111, 163, 195, 231, 274, 368, 465, 467, 541, 550, 582, 583, 653, 656, 702, 721, 722, 737, 759, 825, 890, 892, 894, 897, 910, 954, 963, 966, 1014, 1033, 1083, 1087, 1095, 1100, 1101, 1123, 1147, 1163, 1168, 1170, 1175, 1218, 1219, 1254, 1266, 1345, 1368, 1402, 1454, 1492, 1495, 1503, 1526, 1531, 1532, 1535, 1548, 1562, 1564, 1568, 1582, 1584, 1587, 1588, 1592, 1593, 1597, 1642, 1648, 1661, 1675, 1679, 1687, 1689, 1694, 1717, 1728, 1745, 1752, 1762, 1783, 1792, 1806, 1812, 1819, 1820, 1822, 1826, 1834, 1843, 1850, 1864, 1878, 1886, 1900, 1903, ...], ('2', 'female'): [9, 16, 28, 37, 44, 54, 55, 63, 68, 75, 79, 104, 107, 110, 114, 126, 175, 179, 192, 203, 213, 224, 305, 329, 344, 379, 449, 454, 525, 585, 589, 590, 594, 666, 687, 692, 709, 731, 749, 796, 880, 882, 904, 949, 958, 967, 971, 974, 1005, 1027, 1071, 1094, 1111, 1118, 1136, 1137, 1144, 1186, 1190, 1216, 1237, 1270, 1334, 1399, 1413, 1429, 1430, 1440, 1466, 1470, 1518, 1522, 1524, 1530, 1577, 1612, 1614, 1636, 1722, 1743, 1744, 1774, 1796, 1827, 1905, 1907, 1920, 1944, 1945, 1983, 1989, 1990, 1997, 2062, 2082, 2091, 2098, 2109, 2120, 2156, ...], ('2', 'male'): [3, 6, 8, 11, 17, 24, 33, 39, 42, 76, 119, 124, 146, 158, 184, 210, 212, 217, 218, 241, 265, 270, 295, 299, 302, 317, 319, 334, 340, 343, 398, 405, 408, 413, 419, 445, 458, 517, 540, 571, 591, 617, 623, 640, 642, 645, 674, 675, 683, 684, 707, 729, 735, 738, 742, 743, 750, 755, 767, 769, 774, 798, 799, 833, 841, 865, 869, 927, 930, 937, 942, 961, 1019, 1031, 1048, 1053, 1054, 1059, 1098, 1117, 1121, 1149, 1150, 1152, 1162, 1171, 1182, 1215, 1225, 1236, 1244, 1272, 1278, 1283, 1287, 1306, 1318, 1319, 1325, 1379, ...], ('3', 'female'): [0, 5, 14, 15, 18, 20, 22, 23, 27, 30, 31, 32, 35, 38, 40, 41, 47, 48, 53, 57, 58, 59, 62, 66, 67, 69, 74, 77, 78, 82, 89, 90, 92, 94, 97, 98, 105, 115, 117, 120, 123, 128, 130, 132, 133, 134, 138, 142, 148, 154, 157, 159, 160, 171, 172, 180, 193, 197, 198, 200, 201, 206, 223, 225, 234, 236, 238, 240, 246, 250, 251, 258, 272, 275, 283, 294, 297, 327, 351, 352, 353, 370, 376, 378, 397, 407, 418, 424, 431, 437, 438, 444, 456, 478, 482, 483, 493, 498, 510, 511, ...], ('3', 'male'): [1, 2, 4, 7, 12, 13, 19, 25, 26, 29, 34, 36, 43, 46, 49, 50, 51, 52, 56, 60, 61, 64, 70, 71, 72, 73, 80, 81, 83, 84, 85, 86, 87, 88, 91, 93, 95, 96, 100, 101, 102, 103, 106, 108, 112, 113, 116, 118, 122, 127, 129, 131, 135, 136, 137, 143, 147, 149, 150, 151, 152, 153, 155, 161, 162, 166, 167, 169, 176, 178, 181, 182, 187, 190, 191, 202, 205, 207, 214, 215, 220, 221, 226, 229, 235, 242, 244, 245, 254, 255, 257, 264, 266, 268, 269, 273, 277, 278, 279, 280, ...], ('B', 'male'): [328, 420, 599, 658, 973, 1346, 1355, 1381], ('D', 'male'): [249, 595, 635, 672, 698, 725, 756, 772, 773, 832, 849, 873, 877, 905, 907, 932, 934, 965, 976, 1001, 1012, 1049, 1068, 1070, 1084, 1172, 1200, 1214, 1227, 1239, 1258, 1307, 1323, 1339, 1352, 1371, 1383, 1398, 1407, 1451, 1462, 1510, 1560, 1606, 1608, 1653, 1688, 1695, 1710, 1731, 1734, 1753, 1794, 1804, 1809, 1810, 1823, 1841, 1854, 1861, 1939, 1971, 1973, 1991, 2126, 2127], ('E', 'male'): [216, 230, 233, 303, 313, 324, 325, 326, 341, 346, 356, 374, 377, 383, 393, 403, 404, 409, 410, 432, 436, 440, 452, 460, 464, 470, 475, 476, 484, 486, 489, 490, 494, 501, 505, 506, 508, 509, 515, 520, 529, 531, 533, 548, 553, 557, 572, 575, 576, 586, 592, 593, 598, 605, 611, 613, 618, 622, 626, 627, 628, 631, 644, 647, 651, 654, 655, 661, 667, 670, 671, 677, 681, 688, 705, 708, 716, 726, 727, 739, 740, 741, 748, 751, 752, 760, 776, 778, 783, 791, 797, 800, 801, 804, 807, 812, 814, 828, 836, 837, ...], ('R', 'female'): [361, 1210], ('R', 'male'): [165, 170, 185, 186, 188, 196, 211, 252, 267, 300, 318, 336, 337, 338, 362, 363, 372, 373, 388, 390, 447, 451, 462, 469, 474, 549, 551, 580, 610, 625, 637, 652, 676, 686, 711, 715, 717, 746, 777, 793, 810, 820, 827, 829, 885, 887, 888, 948, 962, 977, 1004, 1026, 1073, 1146, 1224, 1289, 1332, 1363, 1499, 1512, 1515, 1594, 1649, 1830, 1835, 2016, 2159], ('V', 'female'): [558, 685, 1011, 1032, 1191, 1353, 1364, 1369, 1453, 1516, 1707, 1756, 1760, 1764, 1793, 1800, 1891, 1901, 1912, 1914, 1977], ('V', 'male'): [121, 125, 139, 140, 141, 156, 164, 174, 177, 183, 189, 194, 204, 208, 209, 219, 222, 227, 228, 237, 239, 253, 256, 259, 260, 261, 262, 271, 281, 282, 287, 289, 307, 308, 311, 316, 321, 330, 331, 335, 342, 345, 347, 350, 354, 360, 364, 375, 382, 385, 391, 395, 396, 401, 416, 417, 421, 427, 428, 433, 450, 471, 480, 492, 495, 497, 499, 507, 512, 513, 516, 527, 545, 546, 547, 560, 573, 579, 587, 601, 603, 606, 619, 620, 621, 624, 629, 630, 636, 638, 643, 657, 664, 696, 700, 719, 720, 728, 730, 744, ...]}

In [80]:
g.groups.keys()

dict_keys([('1', 'female'), ('1', 'male'), ('2', 'female'), ('2', 'male'), ('3', 'female'), ('3', 'male'), ('B', 'male'), ('D', 'male'), ('E', 'male'), ('R', 'female'), ('R', 'male'), ('V', 'female'), ('V', 'male')])

In [81]:
for (cl, sex), group in g:
    print(f'({cl}, {sex}):')
    print(group[["Name", "Ticket"]])

(1, female):
                                   Name  Ticket
21         ALLISON, Miss Helen Loraine   113781
109           CARTER, Miss Lucile Polk   113760
144           LINES, Miss Mary Conover    17592
145   MADILL, Miss Georgette Alexandra    24160
168                     DICK, Mrs Vera    17474
...                                 ...     ...
2129          STONE, Mrs Martha Evelyn   113572
2135           STRAUS, Mrs Rosalie Ida    17483
2138           COMPTON, Mrs Mary Eliza    17756
2139   CROSBY, Mrs Catherine Elizabeth     5735
2206           WILLARD, Miss Constance   113795

[144 rows x 2 columns]
(1, male):
                                         Name  Ticket
10             ALLISON, Master Hudson Trevor   113781
45                  DODGE, Master Washington    33638
65            SPEDDEN, Master Robert Douglas    16966
99        CARTER, Master William Thornton II   113760
111               RYERSON, Master John Borie    17608
...                                       ...     ...
2187               KEEPING, Mr Edwin Herbert   113503
2189                       KLABER, Mr Herman   113028
2200               SMITH, Mr Richard William   113056
2203                VAN DER HOEF, Mr Wyckoff   111240
2207  WILLIAMS, Mr Fletcher Fellowes Lambert   113510

[180 rows x 2 columns]
(2, female):
                                          Name  Ticket
9                    WEST, Miss Barbara Joyce    34651
16                       LAROCHE, Miss Louise     2123
28                    QUICK, Miss Phyllis May    26360
37    LAROCHE, Miss Simonne Marie Anne Andrée     2123
44                 BECKER, Miss Marion Louise   230136
...                                        ...     ...
2164                         COOK, Mrs Selena    14266
2167           DAVIS, Miss Mary Ann Charlotte   237668
2176                      GARSIDE, Miss Ethel   243880
2182       JACOBSOHN, Mrs Amy Frances Christy   243847
2202                  TROUT, Mrs Jessie Laird   240929

[106 rows x 2 columns]
(2, male):
                                         Name  Ticket
3     HäMäLäINEN, Master Viljo Unto Johannes   250649
6             RICHARDS, Master Sibley George    29106
8               CALDWELL, Master Alden Gates   248738
11                 BECKER, Master Richard F.   230136
17              MALLET, Master André Clement     2079
...                                       ...     ...
2166           DAVIES, Master John Morgan jr    33112
2168               DENBUOY, Mr Albert Joseph    31029
2177              GASKELL, Mr William Alfred   239865
2181             JACOBSOHN, Mr Sidney Samuel   243847
2193               MATTHEWS, Mr William John    28228

[170 rows x 2 columns]
(3, female):
                                         Name  Ticket
0     DEAN, Miss Elizabeth Gladys 'Millvina'     2315
5               BACLINI, Miss Helene Barbara     2666
14               JOHNSON, Miss Eleanor Ileen   347742
15               KLASéN, Miss Gertrud Emilia   350405
18                         NAKID, Miss Maria     2653
...                                       ...     ...
2179             HARKNETT, Miss Alice Phoebe     6609
2186                     JOHNSTON, Mrs Eliza     6607
2191               MAHON, Miss Bridget Delia   330924
2194                  MURPHY, Miss Catherine   367230
2195        MUSLAMaNi, Mrs Fatimah Muhammad      2649

[216 rows x 2 columns]
(3, male):
                                         Name   Ticket
1     DANBOM, Master Gilbert Sigvard Emanuel    347080
2                       TANNuS, Master As'ad      2625
4              PEACOCK, Master Albert Edward   3101315
7                   AKS, Master Frank Philip    392091
12                 DEAN, Master Bertram Vere      2315
...                                       ...      ...
2198             RUSH, Mr Alfred George John     20589
2199                        RYAN, Mr Patrick    371110
2201                      SVENSSON, Mr Johan    347060
2204                  WAZLI, Mr Yousif Ahmed      2647
2205                 WIDEGREN, Mr Carl Peter    347064

[493 rows x 2 columns]
(B, male):
                                      Name  Ticket
328               BRICOUX, Mr Roger Marie   250654
420                     HUME, Mr John Law   250654
599           KRINS, Mr Georges Alexandre   250654
658   BRAILEY, Mr William Theodore Ronald   250654
973     CLARKE, Mr John Frederick Preston   250654
1346           TAYLOR, Mr Percy Cornelius   250654
1355             WOODWARD, Mr John Wesley   250654
1381            HARTLEY, Mr Wallace Henry   250654
(D, male):
                                        Name Ticket
249                     TERRELL, Mr Bertram    <NA>
595                       JEWELL, Mr Archie    <NA>
635                    TAMLYN, Mr Frederick    <NA>
672                     FLEET, Mr Frederick    <NA>
698                    MOODY, Mr James Paul    <NA>
...                                      ...    ...
1971                   MCCARTHY, Mr William    <NA>
1973     NICHOLS, Mr Alfred William Stanley    <NA>
1991                   HUMPHREYS, Mr Sidney    <NA>
2126  O'LOUGHLIN, Dr William Francis Norman    <NA>
2127             SMITH, Captain Edward John    <NA>

[66 rows x 2 columns]
(E, male):
                                         Name Ticket
216                 ERVINE, Mr Albert George    <NA>
230                               LEE, Mr H.    <NA>
233   MITCHELL, Mr Lorenzo (Lawrence) Horace    <NA>
303                   PERRY, Mr Edgar Lionel    <NA>
313         SHILLABEER, Mr Charles Frederick    <NA>
...                                       ...    ...
2088                        COLEMAN, Mr John    <NA>
2090                         JAGO, Mr Joseph    <NA>
2107                  MAY, Mr Arthur William    <NA>
2175               FOSTER, Mr Alfred Charles    <NA>
2188                       KIRKHAM, Mr James    <NA>

[325 rows x 2 columns]
(R, female):
                            Name Ticket
361   MARTIN, Miss Mabel Elvina    <NA>
1210  BOWKER, Miss Ruth Harwood    <NA>
(R, male):
                                          Name Ticket
165                      CROVELLA, Sig. Luigi    <NA>
170              DONATI, Sig. Italo Francesco    <NA>
185                PERACCHIO, Sig. Sebastiano    <NA>
186                        PIATTI, Sig. Louis    <NA>
188                    PRICE, Mr Ernest Cyril    <NA>
...                                        ...    ...
1649                  JAILLET, Mr Henri Marie    <NA>
1830  NANNINI, Sig. Francesco Luigi Arcangelo    <NA>
1835                    SCAVINO, Sig. Candido    <NA>
2016                      ROUSSEAU, Mr Pierre    <NA>
2159               BOCHET, Mr Pierre Giuseppe    <NA>

[67 rows x 2 columns]
(V, female):
                                  Name Ticket
558            SNAPE, Mrs Lucy Violet    <NA>
685     JESSOP, Miss Violet Constance    <NA>
1011             MARSDEN, Miss Evelyn    <NA>
1032                 SLOAN, Miss Mary    <NA>
1191       SLOCOMBE, Mrs Maude Louise    <NA>
1353            WALSH, Miss Catherine    <NA>
1364               BENNETT, Mrs Mabel    <NA>
1369                CATON, Miss Annie    <NA>
1453         PRICHARD, Mrs Alice Maud    <NA>
1516       WALLIS, Mrs Catherine Jane    <NA>
1707         MARTIN, Mrs Annie Martha    <NA>
1756        LAVINGTON, Miss Elizabeth    <NA>
1760             MCLAREN, Mrs Hypatia    <NA>
1764              ROBINSON, Mrs Annie    <NA>
1793      LEATHER, Mrs Elizabeth Mary    <NA>
1800          ROBERTS, Mrs Mary Kezia    <NA>
1891  SMITH, Miss Katherine Elizabeth    <NA>
1901                  BLISS, Mrs Emma    <NA>
1912      GOLD, Mrs Jane Kate Coulson    <NA>
1914               GREGSON, Miss Mary    <NA>
1977           STAP, Miss Sarah Agnes    <NA>
(V, male):
                                  Name Ticket
121         WATSON, Mr William Albert    <NA>
125                BARRATT, Mr Arthur    <NA>
139         HARRIS, Mr Clifford Henry    <NA>
140           HOARE, Mr Leonard James    <NA>
141     HOPKINS, Mr Frederick William    <NA>
...                                ...    ...
2071       BAXTER, Mr Thomas Ferguson    <NA>
2076  JENNER, Mr Thomas Henry (Harry)    <NA>
2077               LATIMER, Mr Andrew    <NA>
2100            RULE, Mr Samuel James    <NA>
2101          BOGIE, Mr Norman Leslie    <NA>

[410 rows x 2 columns]

In [82]:
g.get_group((3, 'male'))

KeyError: (3, 'male')

In [ ]:
# Projektion innerhalb des Group-By Objekts: innerhalb jeder Gruppe wird projekziert
g[["Class", "Sex", "Name", "Ticket"]].head()

     Class     Sex                                     Name   Ticket
0        3  female  DEAN, Miss Elizabeth Gladys 'Millvina'      2315
1        3    male  DANBOM, Master Gilbert Sigvard Emanuel    347080
2        3    male                    TANNuS, Master As'ad      2625
3        2    male  HäMäLäINEN, Master Viljo Unto Johannes    250649
4        3    male           PEACOCK, Master Albert Edward   3101315
...    ...     ...                                      ...      ...
973      B    male       CLARKE, Mr John Frederick Preston    250654
1011     V  female                    MARSDEN, Miss Evelyn      <NA>
1032     V  female                        SLOAN, Miss Mary      <NA>
1191     V  female              SLOCOMBE, Mrs Maude Louise      <NA>
1210     R  female               BOWKER, Miss Ruth Harwood      <NA>

[62 rows x 4 columns]

### Aggregation auf den Gruppen bilden

In [ ]:
g = t.groupby(by=["Class", "Sex"])

In [ ]:
# Wieviel Personen je Gruppe?
g.size()

Class  Sex
1      female    144
       male      180
2      female    106
       male      170
3      female    216
       male      493
B      male        8
D      male       66
E      male      325
R      female      2
       male       67
V      female     21
       male      410
dtype: int64

In [ ]:
# Wieviel not_Werte in der Spalte Age
g["Age"].count()

Class  Sex
1      female    143
       male      174
2      female     99
       male      162
3      female    207
       male      473
B      male        8
D      male       66
E      male      323
R      female      2
       male       66
V      female     21
       male      410
Name: Age, dtype: int64

In [ ]:
t["Price"].unique()

<StringArray>
['£20 11s 6d',     '£14 8s',  '£8 10s 4d',    '£14 10s', '£13 15s 6d',
  '£19 5s 2d',    '£18 15s',      '£9 7s',        '£29',    '£27 15s',
 ...
     '£75 5s',  '£32 6s 5d',  '£9 13s 9d',        '£71', '£34 13s 1d',
 '£10 10s 4d',    '£42 10s',    '£12 13s',    '£33 10s',        '£35']
Length: 282, dtype: string

In [ ]:
# Umsatz je Gruppe in Pfund
g["Price"].sum() # Ohje ;) muss noch in eine Zahl gewandelt werden da Objekt

Class  Sex
1      female    £151 16s£120£39 8s£211 6s 9d£57£57 19s 7d£247 ...
       male      £151 16s£81 17s 2d£134 10s£120£262 7s 6d£47 2s...
2      female    £27 15s£41 11s 7d£26£41 11s 7d£39£23£27 15s£33...
       male      £14 10s£18 15s£29£39£37 1d£26£23£26£18 15s£32 ...
3      female    £20 11s 6d£19 5s 2d£11 2s 8d£12 3s 8d£15 14s 1...
       male      £14 8s£8 10s 4d£13 15s 6d£9 7s£20 11s 6d£46 18...
B      male                                               00000000
D      male          0            0      0              0     0...
E      male                                                    ...
R      female
       male                                                    ...
V      female
       male                                                    ...
Name: Price, dtype: string

In [ ]:
# Anzahl überlebende
g["Survived"].sum()

Class  Sex
1      female    139
       male       62
2      female     94
       male       24
3      female    106
       male       75
B      male        0
D      male       43
E      male       72
R      female      2
       male        1
V      female     18
       male       76
Name: Survived, dtype: Int64

In [ ]:
g["Age_F"].mean()

Class  Sex
1      female    36.888889
       male      40.877778
2      female    28.386792
       male      30.623529
3      female    23.149074
       male      25.688391
B      male         27.625
D      male      33.954545
E      male      30.732308
R      female         25.0
       male      25.328358
V      female    36.809524
       male      31.795122
Name: Age_F, dtype: Float64

Wenn ich Aggregationen auf einen df anwende(ohne Gruppen zu bilden)

In [ ]:
(t["Survived"].sum(), t["Age_F"].mean().round(1))

(712, 30.1)

Nulls in den Gruppen

In [ ]:
gn = t.groupby(["Job"], dropna=False).size() # Durch dropna= False bleiben die NA Werte erhalten
gn

Job
                        885
H&W Guarantee Group       9
Musician                  8
Postal Clerk              5
Servant                  43
Titanic Officers          8
<NA>                   1250
dtype: int64

In [ ]:
t.describe()

          Name_ID        Age  Survived      Age_F     sibsp     parch
count      2208.0     2154.0    2208.0     2206.0    1309.0    1309.0
mean       1104.5   30.15877  0.322464  30.146963  0.498854  0.385027
std    637.539018  11.958248  0.467525   12.11454  1.041658   0.86556
min           1.0       0.17       0.0        0.0       0.0       0.0
25%        552.75       22.0       0.0       22.0       0.0       0.0
50%        1104.5       29.0       0.0       29.0       0.0       0.0
75%       1656.25       37.0       1.0       38.0       1.0       0.0
max        2208.0       71.0       1.0       74.0       8.0       9.0

In [ ]:
g.describe()

AttributeError: 'DataFrame' object has no attribute '_constructor_from_mgr'

Finde Zeilen (innerhalb jeder Gruppe), die Min/Max-Wert für eine Spalte annehmen.

In [ ]:
row = g["Age_F"].idxmin()
row
# t.loc[row]

Class  Sex
1      female     21
       male       10
2      female      9
       male        3
3      female      0
       male        1
B      male      328
D      male      249
E      male      216
R      female    361
       male      188
V      female    558
       male      121
Name: Age_F, dtype: int64

In [ ]:
def gefalter(df):
    gesalter = df["Age_F"].sum()
    nof_kids = df["parch"].count()
    return gesalter/nof_kids

In [ ]:
gefalter(t)

50.80534759358289

In [ ]:
g.apply(gefalter)

C:\Users\Student\AppData\Local\Temp\ipykernel_24804\2795405722.py:4: RuntimeWarning: divide by zero encountered in scalar divide
  return gesalter/nof_kids

Class  Sex
1      female    36.888889
       male      40.877778
2      female    28.386792
       male      30.623529
3      female    23.149074
       male      25.584178
B      male            inf
D      male            inf
E      male            inf
R      female          inf
       male            inf
V      female          inf
       male            inf
dtype: float64

So nochmal `apply()` versuchen

apply auf jede Gruppe (EInzelne df einer gesamten Gruppe)

In [85]:
g["Age"].min()

Class  Sex
1      female     2.0
       male      0.92
2      female    0.83
       male      0.58
3      female    0.17
       male      0.33
B      male      20.0
D      male      18.0
E      male      18.0
R      female    20.0
       male      17.0
V      female    22.0
       male      14.0
Name: Age, dtype: Float64

In [88]:
def f_agg(s):
    return s.iloc[0] + s.iloc[1] # Alter der ersten beiden Personen der Gruppe addieren
g["Age"].apply(f_agg)

Class  Sex
1      female    15.00
       male       4.92
2      female     1.83
       male       1.33
3      female     0.92
       male       0.75
B      male      41.00
D      male      41.00
E      male      36.00
R      female    51.00
       male      34.00
V      female    46.00
       male      29.00
Name: Age, dtype: float64

In [90]:
# gibt es NULL bei Age?
t.loc[t["Age"].isna()][["Class", "Sex", "Age"]].sample(2)

     Class   Sex   Age
2204     3  male  <NA>
2170     3  male  <NA>

In [93]:
def fill_mean(s):
   return s.fillna(s.mean())

g["Age"].apply(fill_mean)

Class  Sex
1      female  21       2.0
               109     13.0
               144     16.0
               145     16.0
               168     17.0
                       ...
V      male    2071    55.0
               2076    55.0
               2077    55.0
               2100    58.0
               2101    59.0
Name: Age, Length: 2208, dtype: Float64

## Transform

In [94]:
t.sample(1)

,Name_ID,Name,Sex,Age,Class,Ticket,Joined,Occupation,Boat [Body],Price,...,Title,First,DoB,Year_Birth,Date_Death,DoB_Clean,Age_F_Code,Age_F,sibsp,parch
519,1076,"KELLY, Miss Mary",female,22.0,3,14312,Queenstown,<NA>,D,£7 15s,...,Miss,Mary,1890-02-19,<NA>,1950-12-27 00:00:00,2/19/1890,C,22.0,0,0

In [98]:
# t.groupby(by="Class")["Survived"].apply('count') #man bekommt die Gruppen
t["survived_per_class"] = t.groupby(by="Class")["Survived"].transform('count') # man bekommt

In [100]:
t[["Name", "Class", "Survived", "survived_per_class"]].sample(3)

                                Name Class  Survived  survived_per_class
15      KLASéN, Miss Gertrud Emilia      3         0                 709
2049  PEUCHEN, Major Arthur Godfrey      1         1                 324
1601                LOVELL, Mr John      V         0                 431